[пр.md](https://github.com/user-attachments/files/27695860/default.md)
# Паспорт проекта

## Название проекта 
СтройBase


## Предметная область
 Строительная компания Услуги, портфолио, заявка на расчёт.
Разрабатывается сайт строительной компании. Пользователь сможет просмотреть список услуг, ознакомиться с портфолио строительной компании и подать заявку на одну из услуг. Администратор может управлять услугами и обрабатывать заявки пользователей.


## Проблема
Строительная компания не может распространять свои услуги в интернете, так чтобы пользователь мог удобно просмотреть предлагаемые услуги и цены, при этом ознакомившись с портфолио компании.

## Цель проекта
разработать веб сайт который позволит строительной компании, позволяющий пользователям просматривать услуги компании и оформлять заказы, а администратору работать с данными и обрабатывать заказы.


## Целевая аудитория
- Клиенты, которые хотят получить услуги строительной компании;
- Администратор, который управляет данными и обрабатывает заявки пользователей.


## Роли пользователей
- Гость - Просмотр публичной части, регистрация, авторизация.
- Пользователь - Выполнение основного действия, заказ услуг.
- Администратор - Управление каталогом и обработка пользовательских действий.


## Контентная сущность
- Контентная сущность услуги 
- Дополнительная сущность аккаунт
- Операционная сущность Запись на оказание услуги

## Основные функции

### Гость
просмотр главной страницы;
- просмотр каталога услуг;
- регистрация;
- авторизация.

### Пользователь

- отправка заявки на услугу;
- выход из системы.

### Администратор

- добавление услуги;
- редактирование услуги;
- удаление услуги;
- просмотр записей пользователей;
- изменение статуса записи.
- изменение портфолио
- изменение описания
- изменение статистики
- изменение подвала

## Данные, которые необходимо хранить:

пользователи;
- роли пользователей;
- услуги;
- записи на услуги;
- статусы записей.
- статистику


## Планируемые страницы

- Главная страница
- Страница входа
- Страница регистрации
- Страница личного кабинета
- Страница оформления услуги
- Административная панель(хап админа)
- Управление каталогами
- Создание предложения
- Управление пользовательскими откликами


## Предполагаемый дизайн-направление
- Цвета: жёлтый, зелёный, серый
- Стиль: минимализм
- Настроение интерфейса: приветливое


## Ожидаемый результат

К защите должнобыть готово:
- Сайт со всеми выше перечисленными страницами
- Все выше перечисленные функции
- Документация к проекту
- Презентация
